ka2_2024/src/AccumulationRegisters/КнигаУчетаДоходовИРасходов/КнигаУчетаДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигаУчетаДоходовИРасходов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Графа4</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Графа5</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Графа6</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Графа7</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДоходЕНВД</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РасходЕНВД</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДоходПатент</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВозникновенияДоходовРасходов</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ДвижениеПрочихАктивовПассивов</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЗаписьКУДиР</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.НачислениеДивидендов</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктПремииПоставщика</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>CatalogRef.ДоговорыАренды</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.РегламентнаяОперация</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваровУХранителя</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ПорчаТоваровУХранителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасходов</name>
    <type>
      <types>EnumRef.ВидыРасходовУСН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.НематериальныеАктивы</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      <types>EnumRef.УдалитьТипыНалогов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>EnumRef.ТипыПлатежейПоАренде</types>
      <types>CatalogRef.ВидыНалоговВзносов</types>
      <types>EnumRef.ВидыНалогов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.ЗаключениеДоговораАренды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ka2_2024/src/AccumulationRegisters/КнигаУчетаДоходовИРасходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.КнигаУчетаДоходовИРасходов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.20.26";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c781827c-c67d-467c-b54b-2ec087a23dd3");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.КнигаУчетаДоходовИРасходов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заменяет статью с перечисления ""Типы налогов"" на статью со справочником ""Виды налогов и взносов"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра	= "РегистрНакопления.КнигаУчетаДоходовИРасходов";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КнигаУчетаДоходовИРасходов.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
	|ГДЕ
	|	КнигаУчетаДоходовИРасходов.Статья ССЫЛКА Перечисление.УдалитьТипыНалогов";
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяРегистра);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущиеДанные Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.КнигаУчетаДоходовИРасходов.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ТекущиеДанные.Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ТекущиеДанные.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Статья = Перечисления.УдалитьТипыНалогов.СсылкаВидыНалоговВзносовПоТипуНалогов(Запись.Статья);
			КонецЦикла;
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ТекущиеДанные.Регистратор);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
